driver-tests/iepse/IEPTupleBasedWindow/TupleBasedWindowApp/test/DeleteStreamInput/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:str="DeleteStreamInput.DeleteStreamInput_iep">
   <soapenv:Header/>
   <soapenv:Body>
      <str:StreamInput0_MsgObj>
         <aInt1>${aInt1.0}</aInt1>
         <aBigint1>${aBigint1.0}</aBigint1>
         <double1>${double1.0}</double1>
         <var1>${var1.0}</var1>
         <aInt2>${aInt2.0}</aInt2>
         <bigint2>${bigint2.0}</bigint2>
         <double2>${double2.0}</double2>
         <var2>${var2.0}</var2>         
      </str:StreamInput0_MsgObj>
   </soapenv:Body>
</soapenv:Envelope>